convergenceStudy/4/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       true;

geometry
{

    hull470.stl
    {
        type triSurfaceMesh;
        name hull;

        patchInfo
        {
            type wall;
        }
    }

}

castellatedMeshControls
{
    maxLocalCells 1000000000;
    maxGlobalCells 2000000000;
    minRefinementCells 0;
    nCellsBetweenLevels 1;
    features
    (
         {
             file "hull470.eMesh";
             level 2;
         }
    );
    refinementSurfaces
    {
        hull
        {
            level (0 0);
        }
    }
    resolveFeatureAngle 5;
    refinementRegions
    {
    }

    locationInMesh (10 0 0);
    allowFreeStandingZoneFaces false;
}




snapControls
{
    nSmoothPatch 5;
    tolerance 1.0;
    nSolveIter 200;
    nRelaxIter 5;
    nFeatureSnapIter 20;
}



addLayersControls
{
    relativeSizes false;
    layers
    {
        hull
        {
            nSurfaceLayers 3;
        }
    }

    expansionRatio 1.2;
    firstLayerThickness	0.002;
    minThickness 0.0001;
    nGrow 0;

    featureAngle 360;

    // Specified to be consistent with v1712 settings (see 1806 release notes)
    mergePatchFacesAngle 60;    // featureAngle
    layerTerminationAngle 30;   // 0.5*featureAngle
    slipFeatureAngle 75;        // 0.5*featureAngle

    nRelaxIter 8;
    nSmoothSurfaceNormals 4;
    nSmoothNormals 4;
    nSmoothThickness 15;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;

    nBufferCellsNoExtrude 0;
    nLayerIter 50;
    nRelaxedIter 20;
}


meshQualityControls
{
    #include "meshQualityDict"
}


// Advanced
// Flags for optional output
// 0 : only write final meshes
// 1 : write intermediate meshes
// 2 : write volScalarField with cellLevel for postprocessing
// 4 : write current intersections as .obj files
debug 0;


mergeTolerance 1E-6;


// ************************************************************************* //
